# يطلب من المستخدم إدخال رقمين (num1 و num2).

num1 = float(input("أدخل الرقم الأول: "))
num2 = float(input("أدخل الرقم الثاني: "))

# يطلب من المستخدم اختيار العملية التي يريد تنفيذها:
#الجمع (+)
#الطرح (-)
#الضرب (*)
#القسمة (/)
#أضف عملية جديدة مثل الأس (num1 ** num2).

print("\nاختر العملية التي تريد تنفيذها:")
print("1. الجمع (+)")
print("2. الطرح (-)")
print("3. الضرب (*)")
print("4. القسمة (/)")
print("5. الأس (**)")


x = input("أدخل الرمز (+ أو - أو * أو /): ")


#يستخدم عبارات if / elif / else لتحديد العملية.

if x == "+":
    n = num1 + num2
    print(f"\nناتج الجمع = {n}")

elif x == "-":
    n = num1 - num2
    print(f"\nناتج الطرح = {n}")

elif x == "*":
    n = num1 * num2
    print(f"\nناتج الضرب = {n}")

elif x == "/":
    if num2 != 0:
        n = num1 / num2
        print(f"\nناتج القسمة = {n}")
    else:
        print("\nخطأ: لا يمكن القسمة على صفر!")

elif x == "**":
    n = num1 ** num2
    print(f"\nناتج الأس = {n}")

else:
    print("\nرمز العملية غير صحيح!")

# بعد عرض الناتج، استخدم عوامل المقارنة لتوضيح العلاقة بين الرقمين (أكبر، أصغر، متساوي)

# مقارنة الرقمين
print("\nالعلاقة بين الرقمين:")
if num1 > num2:
    print(f"{num1} أكبر من {num2}")
elif num1 < num2:
    print(f"{num1} أصغر من {num2}")
else:
    print(f"{num1}  يساوي {num2}")

#استخدم شرطًا يتحقق إن كانت الأرقام سالبة أو موجبة

