#num1 = 10  # إسناد قيمة    يعني وضع قيمة في متغير <= =
#num2 == 20 # == => مقارنة   يعني هل يساوي هذا المتغير هذه القيمة

num1=10
num2=20
print(num1+num2)
print(num2==num1)
print(num2 != num1)
print(num1>num2)
print(num1<num2)


if num2 > num1:
    print("الرقم الثاني اكبر من الرقم الاول") #طباعة رسالة اذا تحقق الشرط لكن لم تتحقق الشرط لن يتم طباعة الرسالة
    print("iine 7")

print("iine 10")

#---------------------------------------
#userneme="Najat"
#password=12345
#password1 = "12345"
userneme= input("ادخل اسم المستخدم: ")
password= int("ادخل كلمة المرور: ")
#print(type(password))


if userneme == "Najat" and password == 12345:
    print("مرحبا نجاة") 

elif password == 1234:
    print("كلمة المرور خطا")

elif userneme == "najat":    
    print("اسم المستخدم خطا")  
      
else:
    print("خطا في اسم المستخدم او كلمة المرور")    
#--------------------------
#ملاحظة:
#num3=1   رقم فقط
#num4="1" شكلها رقم لكنها نص (لأنها بين علامتي تنصيص)
## ____ شروط if/elif/else:_____________________
#  يجب وضع النقطتين : في نهاية السطر
#الكود داخل الشرط يجب أن يكون **مسافة بادئة** (indentation) عادة 4 فراغات
#  elif تعني "إلا إذا" للتحقق من شرط ثاني بعد if
# else تعني "إلا" أو الحالة الافتراضية إذا لم يتحقق أي شرط
#
